In [1]:
import numpy as np
import pandas as pd

In [2]:
veri1={
    "Isim":["Ahmet","Mehmet","Ali"],
    "Alan":["Yazılım","Tıp","Hemşirelik"],
    "Maas":[10000,20000,3000]
}

In [3]:
veri2={
    "Isim":["Ömer","Faruk","Doğan"],
    "Alan":["Bilgisayar","Elektrik","Robotik"],
    "Maas":[10000,20000,30000]
}

In [4]:
data1=pd.DataFrame(veri1)
data2=pd.DataFrame(veri2)

In [7]:
data3=pd.concat([data1,data2])

In [9]:
data3["İndexler"]=[1,2,3,4,5,6]
data3.set_index("İndexler")

            Isim        Alan   Maas
İndexler
1          Ahmet     Yazılım  10000
2         Mehmet         Tıp  20000
3            Ali  Hemşirelik   3000
4           Ömer  Bilgisayar  10000
5          Faruk    Elektrik  20000
6          Doğan     Robotik  30000

## Merge

In [10]:
veri3={
    "Isim":["Ahmet","Mehmet","Ali"],
    "Alan":["Yazılım","Tıp","Hemşirelik"],
    "Maas":[10000,20000,3000]
}
veri4={
    "Isim":["Ahmet","Mehmet","Ali"],
    "Alan":["Yazılım","Tıp","Hemşirelik"],
    "Yas":[18,20,21]
}

In [11]:
dataFrame1=pd.DataFrame(veri3)
dataFrame2=pd.DataFrame(veri4)

In [12]:
merge_Data=pd.merge(dataFrame1,dataFrame2,on="Isim")

In [13]:
merge_Data

     Isim      Alan_x   Maas      Alan_y  Yas
0   Ahmet     Yazılım  10000     Yazılım   18
1  Mehmet         Tıp  20000         Tıp   20
2     Ali  Hemşirelik   3000  Hemşirelik   21

In [16]:
merge_Data.drop("Alan_x", axis=1)

     Isim   Maas      Alan_y  Yas
0   Ahmet  10000     Yazılım   18
1  Mehmet  20000         Tıp   20
2     Ali   3000  Hemşirelik   21